/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : nv_id_cas.h
  版 本 号   :
  作    者   : l00368411
  生成日期   : 2017年05月18日
  最近修改   :
  功能描述   : CCORE CAS项目组NV项ID枚举定义
  函数列表   :
  修改历史   :
  1.日    期   : 2017年05月18日
    作    者   : l00368411
    修改内容   : 创建文件

******************************************************************************/

#ifndef __NV_ID_CAS_H__
#define __NV_ID_CAS_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/****************************************************************************
  1 宏定义
*****************************************************************************/

/* C核NV_ID定义 */
enum COMMON_CAS_NV_ID_ENUM
{

/*        NV ID for CPROC_1X,from 3570 to 3599, begin         */
/* 3570 */      en_NV_Item_CPROC_1X_NVIM_DM_THRESHOLD                   = 3570,

                en_NV_Item_COMMON_GUC_CAS_NVID_BUTT
};

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

/* end of nv_id_cas.h */

